[

][

][
{"name": "Maggie Rogers", "title": "Clinical Social Work/Therapist, LMSW", "address": [" "], "phone": "(646) 679-2395", "statement": "My goal is to foster a safe and supportive environment where clients feel seen, validated, and empowered to express emotions, explore thought processes, and gain a deeper understanding of self. I work collaboratively with my clients to establish goals and identify tools to overcome personal obstacles. I believe that seeking therapy is an act of great courage and vulnerability, and I aim to celebrate each person’s resilience and growth through our work together.", "image": "https://photos.psychologytoday.com/f87cee78-5995-4ad2-adec-bead1974e0f6/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/maggie-rogers-brooklyn-ny/941771"},
{"name": "Aleja Parsons", "title": "Psychologist, PhD", "address": [" "], "phone": "(929) 209-4393", "statement": "I can help you overcome the destructive cycles you’re desperate to change in your relationship. I specialize in getting couples “unstuck” from the underlying issues that often fuel unhappiness and disconnection. I work from a multicultural framework and am especially attuned to all the identities that make you who you are.", "image": "https://photos.psychologytoday.com/e9a0ffef-3cdc-4143-be1b-10dcaf740b91/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/aleja-parsons-brooklyn-ny/883556"},
{"name": "Fai Tsoi", "title": "Counselor, LMHC, MA, NCC", "address": [" "], "phone": "(718) 313-3562", "statement": "These days, we are busy and stressed. It seems that the tasks never end, and the work never stops. Everyday seems to have something new that can potentially bring down a delicate balance that we have worked so hard to achieve. We hear about self-care and work/life balance, but we struggle to do these things. You want to do it all but there never seems to be enough time. Sometimes work, school, family, friends, or anything else makes it difficult for you to have some time to process and think.", "image": "https://photos.psychologytoday.com/bfc222a3-7877-4646-bc14-1d0dac136647/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/fai-tsoi-brooklyn-ny/891444"},
{"name": "Mona Stevenson", "title": "Counselor, MSEd, NCC, LMHC", "address": [" "], "phone": "(646) 593-8298", "statement": "My first focus when working with a client is to develop a trusting relationship.  I believe this is necessary to be able to help them to work through the problems they may encounter in their lives.  Clients come to me with problems which may include feelings of depression and sadness, dealing with conflict in relationships, understanding issues of identity, coping with grief and loss and making important life decisions such as in career, education and health.", "image": "https://photos.psychologytoday.com/3c897a5f-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/mona-stevenson-brooklyn-ny/119951"},
{"name": "Frances Field", "title": "Marriage & Family Therapist Associate, MFT-LP", "address": [" "], "phone": "(917) 935-4942", "statement": "No one can tell what's really going on. You are doing everything to try and keep it ALL under control: your job, relationships with family and friends, and your relationship with your partner. But inside, your thoughts are racing, its hard for you to take a deep breath and concentrate, you can't sleep well and your constantly overwhelmed. You are not sure how much more you can take.", "image": "https://photos.psychologytoday.com/bac965f9-4550-49f4-8587-4583c5622a02/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/frances-field-brooklyn-ny/948174"},
{"name": "Cresa Galarrita", "title": "Counselor, MS, LMHC", "address": [" "], "phone": "(929) 203-8438", "statement": "My areas of focus and expertise address healing from trauma, family conflict, anxiety, depression, anger, adjustment challenges, and mindfulness.  My dedicated work with children, adolescents, and adults, has served to reinforce my goal of holistically improving the lives of my clients. My job as a therapist is to support and empower you to reach your own goals within the context of a safe and profound human relationship.  Please inquire via e-mail for the fastest response time.", "image": "https://photos.psychologytoday.com/50c56f5a-46cd-11ea-a6ad-06142c356176/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/cresa-galarrita-brooklyn-ny/482361"},
{"name": "Magda Rangel-Hendrick", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(646) 787-0747", "statement": "I am a licensed clinical social worker with over a decade of experience helping adolescents and adults work through life transitions, anxiety, depression, grief, loss and trauma. In my practice I see first-hand the growth that can happen when one feels connected and truly seen. My training in evidence based and psychodynamic therapy will guide us as we work together towards personal growth .", "image": "https://photos.psychologytoday.com/25650de3-5112-4129-84e9-0c58a3e6bf02/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/magda-rangel-hendrick-brooklyn-ny/462370"},
{"name": "Anne P Maxwell", "title": "Psychologist, PhD", "address": [" "], "phone": "(718) 571-8677", "statement": "I enjoy working with children, teens and adults who struggle with a variety of issues including depression, anxiety, grief, trauma and situational stressors.  I also work with more specific issues including OCD, ADHD, and Asperger's syndrome.  I am certified to treat children, adolescents and young adults with internet addictions (gaming, social media, compulsive information seeking).", "image": "https://photos.psychologytoday.com/0b7c7805-b14b-4f73-91cf-df1aea11257c/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/anne-p-maxwell-brooklyn-ny/1188626"},
{"name": "Mi Seon Kang", "title": "Art Therapist, LCAT, ATR-BC", "address": [" "], "phone": "(917) 633-9191", "statement": "As you embark on the courageous path of self-discovery and healing from trauma, connecting with a caring, collaborative, skillful therapist is a crucial first step. With years of experience, I offer a warm, reflective, and compassionate safe space for you to explore your deep inner feelings/emotions, and become aware of thoughts, beliefs,  behavior patterns that may no longer serve you. If you have been suffering from anxiety, depression, self-sabotaging thoughts, overwhelming emotions, psychosomatic symptoms, and relationship challenges, I invite you to reach out for support and guidance—and not to struggle or suffer alone.", "image": "https://photos.psychologytoday.com/534abaa3-d650-4e35-8462-112c9caaa5a8/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/mi-seon-kang-brooklyn-ny/708720"},
{"name": "Ari Rozenberg", "title": "MHC-LP", "address": [" "], "phone": "(347) 695-4801", "statement": "Ari is passionate about delivering treatment centered around the client’s unique goals and approaches his clinical work with an emphasis on collaborative problem-solving and cognitive behavioral interventions. Ari works with clients to develop an expanded repertoire of skills and responses to choose from in navigating the challenges of daily life and provide the support needed to trust and validate their thoughts, behaviors, and emotional experiences. The aim is to allow clients the freedom to live in a manner that is consistent with their long-term goals and core values.", "image": "https://photos.psychologytoday.com/df65dc30-f58c-4265-8244-5fa0595cc155/4/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/ari-rozenberg-brooklyn-ny/1136038"},
{"name": "Elyan Rosenbaum | Women's Anxiety And Trauma Therapist Providing Emdr And Ifs", "title": "Counselor, MA, LMHC, NCC", "address": [" "], "phone": "(347) 801-7513", "statement": "The stress of trying to manage it all when it feels like you're drowning is exhausting! I specialize in working with women feeling overwhelmed by relationship issues, parenting challenges, a devastating loss, or traumatic event. My clients often struggle with feeling depleted; they're tired, their thoughts keep racing, the anxiety's overwhelming, and they can feel very stuck and all alone with their pain. It's a lot! And when life stressors occur it's ok to not feel ok, it's human. Some who are used to doing things on their own may question why healing would be any different and so continue to suffer. You don't need to go it alone.", "image": "https://photos.psychologytoday.com/7b00d7cb-262e-4a28-ab7f-a24eeb219917/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/elyan-rosenbaum-womens-anxiety-and-trauma-therapist-providing-emdr-and-ifs-brooklyn-ny/863802"},
{"name": "Racquel Jones", "title": "Licensed Master Social Worker, LMSW", "address": [" "], "phone": "(929) 203-8799", "statement": "Pursuing therapy can be a daunting step and finding a therapist you can connect with and trust is a big part of treatment success. I am experienced in a wide range of life's stressors and difficulties. We will work together to instill self understanding and to learn to adopt new attitudes and feelings towards life situation through effective evidence based, psychotherapy methods. I would love to hear your story and support you. As a therapist my goal is to help you understand what both in the here and now and in the past experiences contribute to your life's stressors and work with you to find immediate and long lasting solutions.", "image": "https://photos.psychologytoday.com/dd4f269a-8659-4487-83a2-bfb23efe0ea7/1/320x400.png", "profile_url": "https://www.psychologytoday.com/us/therapists/racquel-jones-brooklyn-ny/1024664"},
{"name": "Charlene Baudet", "title": "Counselor, LMHC", "address": [" "], "phone": "(347) 970-5677", "statement": "Hi! I'm Charlene, and I'll keep this nice and short for you since I also know what it's like to be scrolling through psychtoday on the hunt for a new therapist but overwhelmed by your options. In not so many words, I'm a French-Moroccan licensed mental health counselor specialized in LGBTQ+ health and wellness. I am trained and experienced in the Harm Reduction Psychotherapy to also help clients with any substance use/misuse/and/or abuse reach their goals. Using a person-centered approach I am here to help you reach your goals and thrive in your day to day life.", "image": "https://photos.psychologytoday.com/625188cd-6305-4738-85ee-e67dc33a30e0/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/charlene-baudet-brooklyn-ny/954307"},
{"name": "Amrita Richards", "title": "MHC-LP", "address": [" "], "phone": "(929) 930-6056", "statement": "Are you questioning your decisions, feeling like a failure, struggling with self-esteem and not feeling like you are enough? I'm here to support you on this journey. I use EMDR and IFS techniques to dive into those doubts and insecurities, uncovering the root of your struggles. The work lies in untangling the intricacies of culture and finding that awesome, authentic you hidden beneath it all.  Let's sit down and have a heart-to-heart, no judgment here.", "image": "https://photos.psychologytoday.com/ec103945-7390-431d-9edf-081233238faf/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/amrita-richards-brooklyn-ny/1275201"},
{"name": "Nehemiah Israel Ben - Zev", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(718) 677-0036", "statement": "My approach to tackling life's difficult moments is via the interface of classical  Judaeo-spiritual teachings and the psychological approach of Cognitive Behavioral Therapy. (CBT). The cognitive behavioral approach to psychotherapy teaches that ideation determines the way one feels and acts. Changing the way one thinks triggers a change in the way one feels. I also use \"a strengths perspective\" focusing on the client's stengths which serve to compensate for one's weaknesses. The interface of these three approaches is transformative, and life changing serving to help a client return to his or her innate and authentic self.", "image": "https://photos.psychologytoday.com/3d985c0c-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/nehemiah-israel-ben-zev-brooklyn-ny/203084"},
{"name": "Bryana Greer", "title": "Pre-Licensed Professional, MSEd, MHC-LP", "address": [" "], "phone": "(929) 930-5208", "statement": "I will create a safe space for you to be your authentic self while feeling heard and understood. I support people who are facing life stressors such as anxiety, depression, and trauma. I have experience working with individuals within many diverse populations such as the LGBTQ+ community, those living with disabilities, BIPOC, and young adults. Please reach out to schedule a free phone consult to see if we'd be a good fit. I look forward to meeting you!", "image": "https://photos.psychologytoday.com/7990eb73-eecc-4926-9472-6d115c43a8d8/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/bryana-greer-brooklyn-ny/1023270"},
{"name": "Ian Hollender", "title": "Psychologist, PhD", "address": [" "], "phone": "(646) 941-8499", "statement": "I make use of an integrated approach to psychotherapy that is individualized based on client need, incorporating cognitive behavioral, and dynamic approaches as appropriate, to address difficulties with mood, behavior, motivation, and relationships.  I offer both short and longer term support, as you see fit, to help you grapple with the obstacles you are facing.", "image": "https://photos.psychologytoday.com/0d434a24-7087-40bf-bfe9-43509cead386/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/ian-hollender-brooklyn-ny/204683"},
{"name": "Allison Meade", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(718) 208-9342", "statement": "Whether you're feeling depressed, anxious, hopeless, or lost, making that first call for help can often be hard.  You desperately want to feel better, but you may be afraid of what it will be like to share your thoughts with a therapist.  I understand.  My guiding principles are respect, appreciation of differences, and a balance between acceptance and change.  I listen carefully and center the therapy around your needs.  Through a truly mutual collaboration, we can find ways to solve problems and create healing.", "image": "https://photos.psychologytoday.com/42a1e8a1-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/allison-meade-brooklyn-ny/90563"},
{"name": "Mickey Field - Jamron Counseling", "title": "Pre-Licensed Professional, MA", "address": [" "], "phone": "(929) 339-1569", "statement": "One of the few certainties of life is change, which can come with excitement but also uncertainty and hardship. Whether you are experiencing the stressors of adolescence or young adulthood, confronting relationship issues, or wanting to examine your inner world, therapy can be a useful tool in navigating life transitions. I’m particularly interested in exploring issues surrounding anxiety, depression, relationships, self-worth, grief, gender identity, and sexuality. Together we can discover your wants and needs and take action towards reaching your goals.", "image": "https://photos.psychologytoday.com/98e555af-0a02-47e4-b14e-633be036a3ef/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/mickey-field-jamron-counseling-brooklyn-ny/1265564"},
{"name": "Atiba Okera McLean", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(929) 348-2398", "statement": "My ideal client is the individual who can acknowledge that they need help and is willing to challenge themselves. I am not a magician; I am just a therapist who is willing to go as far as you can.  I am presently growing my practice and I have a group of clinicians who work with me. They are just as qualified and are committed to providing you with the services you need. If we are unable to assist you, we will not hesitate to make a necessary referral. Either way, we strive to be judgment-free.", "image": "https://photos.psychologytoday.com/9105b128-0155-4380-8d8a-412cec6469ef/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/atiba-okera-mclean-brooklyn-ny/856037"},
{"name": "Jemila McPhee", "title": "Licensed Master Social Worker, LMSW", "address": [" "], "phone": "(347) 370-3822", "statement": "Hello! I am a Licensed Clinical Social Worker who has experience working with individuals who struggle with anxiety, stress, depression, anger, feeling stuck in their jobs or careers, low confidence, decision making and trauma.", "image": "https://photos.psychologytoday.com/90e733d7-57b5-4dae-9ae1-f4f2a88d4874/2/320x400.png", "profile_url": "https://www.psychologytoday.com/us/therapists/jemila-mcphee-brooklyn-ny/1054582"},
{"name": "Lea Cheen", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(332) 248-0632", "statement": "Therapy provides individuals with a safe place to show up exactly as they are, and to have the opportunity to understand themselves more deeply. My hope is to support you, empower you to use your voice, and walk alongside you through your healing process. My counseling style is warm, interactive, and client-driven. I am a psychodynamically oriented therapist, incorporating components of Cognitive Behavioral Therapy (CBT), relational therapy, and mindfulness practices. I know firsthand how transformative therapy can be, and I am honored to co-create a space of openness and growth with my clients.", "image": "https://photos.psychologytoday.com/2b7e5fca-6c49-4fc7-9210-2b86cb5eefae/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/lea-cheen-brooklyn-ny/904048"},
{"name": "Yuriko Kyono", "title": "MHC-LP", "address": [" "], "phone": "(718) 571-8516", "statement": "Do you have difficulty connecting with the people most important to you? Do you find yourself feeling stuck, unable to communicate your needs, wondering what the future will bring? For many, loneliness, lack of support, or instability in a relationship can be a source of stress, anxiety and depression. Therapy is a place where you can shed light on who you are as a person, recognize what holds you back and understand what can be done to help you move forward. It is an opportunity to learn how to be present in your important relationships and make choices from a place of confidence and clarity.", "image": "https://photos.psychologytoday.com/f9fd26b9-2669-4778-912b-2cabe018b35f/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/yuriko-kyono-brooklyn-ny/1199031"},
{"name": "Lauri Nagel", "title": "Clinical Social Work/Therapist, LCSW-R", "address": [" "], "phone": "(646) 583-1421", "statement": "Drawing from my background in psychoanalytic psychotherapy, CBT, mindfulness, somatic therapy, and dance/movement therapy, I use an eclectic approach tailored to your individual needs to help you overcome obstacles to leading a richer, more satisfying, and more meaningful life.  Some of the things I can help you with are: anxiety, depression, relationship issues, family stressors, managing chronic illness, caregiver stress, body image, self-esteem, life transitions, artist's issues and creative blocks, panic attacks, trauma, and life changes.", "image": "https://photos.psychologytoday.com/df89664b-fd77-42de-93ce-21258c9f296d/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/lauri-nagel-brooklyn-ny/59774"},
{"name": "Brooklyn Psychedelic Therapy", "title": "Counselor, LMHC, RYT", "address": [" "], "phone": "(347) 757-4932", "statement": "Feeling disconnected from yourself and your emotions? Is life “fine” on paper but still feels like something is missing? Seeking insight into your path and purpose in life? Used consciously and within the safety and trust of the therapeutic relationship, Ketamine Assisted Psychotherapy (KAP) offers us the ability to not only cognitively understand - but rather - experience ourselves and our lives in an entirely new and transformative way. This offers unshakeable awareness into who we really are, what deeply held negative beliefs and patterns we need to let go of, and the courage to claim our newfound freedom and belonging.", "image": "https://photos.psychologytoday.com/d094756f-beae-4037-9bdd-53938c29b138/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/brooklyn-psychedelic-therapy-brooklyn-ny/1197253"},
{"name": "Jill Kaiser", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(914) 214-1649", "statement": "With 20 years experience counseling clients, my style is warm, supportive and interactive, and within that therapeutic relationship, you may begin to identify obstacles and patterns, gain self-understanding and promote life changes and solutions. Through collaboration, we work to set realistic, achievable goals and sort through all the possibilities to promote satisfying decisions and relationships. Among my interests and strengths are women’s issues, parenting, balancing work and family challenges, life transitions, workplace difficulties and reducing symptoms of depression, anxiety, grief and loss.", "image": "https://photos.psychologytoday.com/510b185d-46cd-11ea-a6ad-06142c356176/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/jill-kaiser-brooklyn-ny/40248"},
{"name": "Lola Rigg", "title": "Clinical Social Work/Therapist, LCSW, CAMS", "address": [" "], "phone": "(866) 969-5326", "statement": "I am a Licensed Clinical  Social Worker, with extensive experience helping individuals and families through crisis, depression, anger, and  traumatic experiences from sexual violence, war, sex trafficking and  domestic violence. I am culturally sensitive to the issues of all family types- including LGBT families and offer individual, family &  marital coaching, parenting education, court mandated anger management,  and utilize a variety of therapeutic approaches in working with depressive disorders. For more than ten years I have  successfully engaged in the practice of Social Work and   believe that as wellness takes place individuals  are able to rise to their full potential and engage life in meaningful ways.", "image": "https://photos.psychologytoday.com/3df71e12-46cd-11ea-a6ad-06142c356176/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/lola-rigg-brooklyn-ny/213131"},
{"name": "Emily Hughes", "title": "Art Therapist, LCAT, ATR-BC", "address": [" "], "phone": "(929) 538-3539", "statement": "Is anxiety hindering your ability to fully embrace life? Feeling trapped and uncertain can leave you questioning your true identity and interfere with your most valued relationships and goals. Within you, there are aspirations and untapped potential awaiting discovery. You yearn for clarity, empowerment, and the confidence to make decisions without constant self-doubt. You're searching for a therapist you connect with to help better understand your anxiety, uncover its underlying causes, and equip you with practical tools and techniques to manage its impact on your life and develop the best version of yourself.", "image": "https://photos.psychologytoday.com/7ff4a093-039c-404e-b486-a4b718b62efa/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/emily-hughes-brooklyn-ny/920477"},
{"name": "Su Zhao", "title": "Counselor", "address": [" "], "phone": "(929) 470-7395", "statement": "I often hear this from my clients “I am an angry/depressed/anxious person!” However, your depression/anxiety/anger is just a part of you, it is not all of you. I am interested in exploring this angry/depressed/anxious part with you. But I encourage you to notice other parts in you that were forgotten or hidden. I will support you to be aware and utilize these other parts. I invite your creativity, curiosity and playfulness. I might ask you to be certain parts of you such as letting you speak from the angry part and exaggerate it! All the parts are invited and accepted in this safe space.", "image": "https://photos.psychologytoday.com/09d2e44b-2b6a-42ec-a63b-6f945e31d564/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/su-zhao-brooklyn-ny/1011400"},
{"name": "Dr. Hebah Khalifa", "title": "Clinical Social Work/Therapist, PhD, LCSW-R", "address": [" "], "phone": "(718) 751-0298", "statement": "I am happy to see you via video sessions (only) during this time. My name is Hebah (pronounced Hib-a), and I am excited you found my profile. Therapy is about discussing your problems, but that’s only the beginning.  When you develop a relationship with an empathic, attuned therapist, you will find your inherent strength, heal old emotional wounds, discover new ways to solve problems and change how you live your life. I am a bilingual (English/Arabic) therapist with over ten years of psychotherapy experience. I use a straightforward, gentle, respectful, non-blaming, culturally sensitive approach to counseling.", "image": "https://photos.psychologytoday.com/dd0ca130-5075-4134-bcc8-e8537a18a48e/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/hebah-khalifa-brooklyn-ny/882809"},
{"name": "Meghan Graniello", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(718) 550-6775", "statement": "I am a New York-based psychotherapist providing consultation as well as short- and long-term therapy to individuals, couples, and families. My clients often reach out when experiencing difficult life transitions, emotional upheaval, feelings of \"stuckness,\"  parenting concerns, relationship conflict, or loss. My practice is affirming and inclusive of clients of all backgrounds, identities, and family structures.", "image": "https://photos.psychologytoday.com/f501174e-d3d4-495b-b3a8-a8c7301ec3d5/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/meghan-graniello-brooklyn-ny/983364"},
{"name": "Dr. Sakima Gonzalez", "title": "Clinical Social Work/Therapist, DSW, LCSW", "address": [" "], "phone": "(718) 808-9142", "statement": "Are you feeling like you do not know how to deal with your emotions? Feeling sad, nervous, misunderstood, numb, empty? Have you tried to look for help and do not know where to start? If you are struggling with these situations, I offer you a safe space to explore your emotions, make connections and learn the skills to have a fulfilled life.", "image": "https://photos.psychologytoday.com/1bbf0434-9d99-459a-8d05-e057dd32c7a5/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/sakima-gonzalez-brooklyn-ny/1116687"},
{"name": "Ellen Yom", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(347) 851-1682", "statement": "Whether you are a single adult, a partner, or a parent, we all struggle with stressors such as feelings of anxiety and depression, low self-esteem, financial pressures, and difficult relationships. Therapy can be a useful way to explore where you feel stuck, and discover alternate ways to manage and cope so that you can live the life you envision for yourself. I use a collaborative, holistic, and relational approach to create a safe and brave environment where individuals, couples, and families can explore themselves and their relationships. l use interventions from various therapies, such as CBT and mindfulness.", "image": "https://photos.psychologytoday.com/46738366-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/ellen-yom-brooklyn-ny/382628"},
{"name": "Charlie Schweikert", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(646) 759-9351", "statement": "Starting the therapy process can lead to a fulfilling experience.   Whether you are experiencing a crisis, or want to gain a deeper understanding of how you operate, becoming involved in therapy can broaden your life by becoming aware of unconscious influences of the past and their connection to behaviors in the present. Therapy can also be a space for people to approach conflict with loved ones.  If you're feeling unsure about therapy, give me a call and we can set up a free phone consultation.", "image": "https://photos.psychologytoday.com/6adb27fd-e9f9-420b-b279-419f0e854f0b/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/charlie-schweikert-brooklyn-ny/260136"},
{"name": "Ranjana Hari", "title": "Pre-Licensed Professional, PsyD, NCSP", "address": [" "], "phone": null, "statement": "I'm a dedicated psychotherapist with an extensive and diverse background, spanning private practice, schools, college clinics, foster care, and hospitals, including acute care. With a passion for treating individuals of all ages, I specialize in harnessing the power of evidence-based therapies to create long-lasting positive change, focusing on the core of issues, rather than surface change. I take pride in fostering a safe, warm, and compassionate environment that embraces the unique perspectives of clients from diverse backgrounds. Even the most resistant patients find themselves engaged in the therapeutic process under my care.", "image": "https://photos.psychologytoday.com/0517af1b-ce3f-4fd8-ac48-0e4492565610/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/ranjana-hari-brooklyn-ny/1183782"},
{"name": "Sabrina M Hendricks", "title": null, "address": [" "], "phone": "(347) 941-1699", "statement": "A client wants to feel confident knowing that the therapist they select is there for them by listening without passing judgement, and their sessions are confidential.  In other words, the client wants to feel that I can help them figure out the problem(s) with goals that they have to follow in order to get better.", "image": "https://photos.psychologytoday.com/7f84bce1-b41c-4ede-90f2-6bb15a88f85c/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/sabrina-m-hendricks-brooklyn-ny/908829"},
{"name": "Queen Ravenden", "title": "Art Therapist, R-DMT, LCAT", "address": [" "], "phone": "(646) 630-7810", "statement": "Greetings and peace to you, divine being. I am a black, caribbean american, creative arts therapist providing safe, affirming, uplifting, and holistic healing. My therapeutic style uses a strength-based approach while incorporating creative art therapy techniques and catering to the balance & overall wellbeing of the mind, body, & soul. I work with individuals to overcome low self-esteem, self-doubt, anxiety, past traumas, and depression using creative arts therapy.", "image": "https://photos.psychologytoday.com/e8618b63-84b8-44f9-bc49-0603b459f0e4/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/queen-ravenden-brooklyn-ny/769582"},
{"name": "Kafi Alfred-Stewart", "title": "MHC-LP", "address": [" "], "phone": "(929) 416-0212", "statement": "Life can be beautiful and full of meaning but it can also be difficult and overwhelming.  Do you feel overwhelmed with feelings of anxiety, depression, inadequacy, struggling with family and friends relationship….come talk to me! I offer therapy for adults and children residing in New York State. No two people are the same which is why no two treatments are the same, so I adopt a collaborative approach to treatment. Together, we will work on strategies and treatment tailored to your individual needs to achieve the outcomes that are important to you and improve the quality of your life. You deserve to live a meaningful and beautiful", "image": "https://photos.psychologytoday.com/f2870875-f1b3-4870-bbd2-ef8a05f5da36/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/kafi-alfred-stewart-brooklyn-ny/1101584"},
{"name": "Stacy - Anastasiya Savchuk", "title": "MA, MHC-LP", "address": [" "], "phone": "(929) 930-4921", "statement": "Anxiety and depression are debilitating conditions that drain the vibrance out of life. They can make it difficult to function and manage daily tasks. The stress piles up and prevents us from feeling joy and well-being. I know firsthand how hard dealing with these issues can be. Together we can overcome the struggles and help you find relief.", "image": "https://photos.psychologytoday.com/f3dca0d0-f37f-4eea-92c4-39150478c834/1/320x400.png", "profile_url": "https://www.psychologytoday.com/us/therapists/stacy-anastasiya-savchuk-brooklyn-ny/1000409"},
{"name": "Vera Chanah Friedman", "title": "Clinical Social Work/Therapist, LMSW", "address": [" "], "phone": "(646) 825-6852", "statement": "I specialize in working with children and adolescents grappling with challenges related to emotional regulation and distress tolerance. My approach is rooted in compassion and evidence-based practices, and I take pride in tailoring therapy sessions and treatment plans to meet your child's unique needs. My clinical experience includes working with individuals who have acute and chronic trauma, adjustment disorders, ADHD, ASD, behavioral concerns encountered at home and in school, global developmental delays, mood disorders, OCD, and PTSD.", "image": "https://photos.psychologytoday.com/6c3022dc-b10b-4af1-b64f-df62b638ced7/1/320x400.png", "profile_url": "https://www.psychologytoday.com/us/therapists/vera-chanah-friedman-brooklyn-ny/1195598"},
{"name": "Maggie Rogers", "title": "Clinical Social Work/Therapist, LMSW", "address": [" "], "phone": "(646) 679-2395", "statement": "My goal is to foster a safe and supportive environment where clients feel seen, validated, and empowered to express emotions, explore thought processes, and gain a deeper understanding of self. I work collaboratively with my clients to establish goals and identify tools to overcome personal obstacles. I believe that seeking therapy is an act of great courage and vulnerability, and I aim to celebrate each person’s resilience and growth through our work together.", "image": "https://photos.psychologytoday.com/f87cee78-5995-4ad2-adec-bead1974e0f6/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/maggie-rogers-brooklyn-ny/941771"},
{"name": "Aleja Parsons", "title": "Psychologist, PhD", "address": [" "], "phone": "(929) 209-4393", "statement": "I can help you overcome the destructive cycles you’re desperate to change in your relationship. I specialize in getting couples “unstuck” from the underlying issues that often fuel unhappiness and disconnection. I work from a multicultural framework and am especially attuned to all the identities that make you who you are.", "image": "https://photos.psychologytoday.com/e9a0ffef-3cdc-4143-be1b-10dcaf740b91/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/aleja-parsons-brooklyn-ny/883556"},
{"name": "Fai Tsoi", "title": "Counselor, LMHC, MA, NCC", "address": [" "], "phone": "(718) 313-3562", "statement": "These days, we are busy and stressed. It seems that the tasks never end, and the work never stops. Everyday seems to have something new that can potentially bring down a delicate balance that we have worked so hard to achieve. We hear about self-care and work/life balance, but we struggle to do these things. You want to do it all but there never seems to be enough time. Sometimes work, school, family, friends, or anything else makes it difficult for you to have some time to process and think.", "image": "https://photos.psychologytoday.com/bfc222a3-7877-4646-bc14-1d0dac136647/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/fai-tsoi-brooklyn-ny/891444"},
{"name": "Mona Stevenson", "title": "Counselor, MSEd, NCC, LMHC", "address": [" "], "phone": "(646) 593-8298", "statement": "My first focus when working with a client is to develop a trusting relationship.  I believe this is necessary to be able to help them to work through the problems they may encounter in their lives.  Clients come to me with problems which may include feelings of depression and sadness, dealing with conflict in relationships, understanding issues of identity, coping with grief and loss and making important life decisions such as in career, education and health.", "image": "https://photos.psychologytoday.com/3c897a5f-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/mona-stevenson-brooklyn-ny/119951"},
{"name": "Frances Field", "title": "Marriage & Family Therapist Associate, MFT-LP", "address": [" "], "phone": "(917) 935-4942", "statement": "No one can tell what's really going on. You are doing everything to try and keep it ALL under control: your job, relationships with family and friends, and your relationship with your partner. But inside, your thoughts are racing, its hard for you to take a deep breath and concentrate, you can't sleep well and your constantly overwhelmed. You are not sure how much more you can take.", "image": "https://photos.psychologytoday.com/bac965f9-4550-49f4-8587-4583c5622a02/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/frances-field-brooklyn-ny/948174"},
{"name": "Cresa Galarrita", "title": "Counselor, MS, LMHC", "address": [" "], "phone": "(929) 203-8438", "statement": "My areas of focus and expertise address healing from trauma, family conflict, anxiety, depression, anger, adjustment challenges, and mindfulness.  My dedicated work with children, adolescents, and adults, has served to reinforce my goal of holistically improving the lives of my clients. My job as a therapist is to support and empower you to reach your own goals within the context of a safe and profound human relationship.  Please inquire via e-mail for the fastest response time.", "image": "https://photos.psychologytoday.com/50c56f5a-46cd-11ea-a6ad-06142c356176/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/cresa-galarrita-brooklyn-ny/482361"},
{"name": "Magda Rangel-Hendrick", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(646) 787-0747", "statement": "I am a licensed clinical social worker with over a decade of experience helping adolescents and adults work through life transitions, anxiety, depression, grief, loss and trauma. In my practice I see first-hand the growth that can happen when one feels connected and truly seen. My training in evidence based and psychodynamic therapy will guide us as we work together towards personal growth .", "image": "https://photos.psychologytoday.com/25650de3-5112-4129-84e9-0c58a3e6bf02/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/magda-rangel-hendrick-brooklyn-ny/462370"},
{"name": "Anne P Maxwell", "title": "Psychologist, PhD", "address": [" "], "phone": "(718) 571-8677", "statement": "I enjoy working with children, teens and adults who struggle with a variety of issues including depression, anxiety, grief, trauma and situational stressors.  I also work with more specific issues including OCD, ADHD, and Asperger's syndrome.  I am certified to treat children, adolescents and young adults with internet addictions (gaming, social media, compulsive information seeking).", "image": "https://photos.psychologytoday.com/0b7c7805-b14b-4f73-91cf-df1aea11257c/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/anne-p-maxwell-brooklyn-ny/1188626"},
{"name": "Mi Seon Kang", "title": "Art Therapist, LCAT, ATR-BC", "address": [" "], "phone": "(917) 633-9191", "statement": "As you embark on the courageous path of self-discovery and healing from trauma, connecting with a caring, collaborative, skillful therapist is a crucial first step. With years of experience, I offer a warm, reflective, and compassionate safe space for you to explore your deep inner feelings/emotions, and become aware of thoughts, beliefs,  behavior patterns that may no longer serve you. If you have been suffering from anxiety, depression, self-sabotaging thoughts, overwhelming emotions, psychosomatic symptoms, and relationship challenges, I invite you to reach out for support and guidance—and not to struggle or suffer alone.", "image": "https://photos.psychologytoday.com/534abaa3-d650-4e35-8462-112c9caaa5a8/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/mi-seon-kang-brooklyn-ny/708720"},
{"name": "Ari Rozenberg", "title": "MHC-LP", "address": [" "], "phone": "(347) 695-4801", "statement": "Ari is passionate about delivering treatment centered around the client’s unique goals and approaches his clinical work with an emphasis on collaborative problem-solving and cognitive behavioral interventions. Ari works with clients to develop an expanded repertoire of skills and responses to choose from in navigating the challenges of daily life and provide the support needed to trust and validate their thoughts, behaviors, and emotional experiences. The aim is to allow clients the freedom to live in a manner that is consistent with their long-term goals and core values.", "image": "https://photos.psychologytoday.com/df65dc30-f58c-4265-8244-5fa0595cc155/4/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/ari-rozenberg-brooklyn-ny/1136038"},
{"name": "Elyan Rosenbaum | Women's Anxiety And Trauma Therapist Providing Emdr And Ifs", "title": "Counselor, MA, LMHC, NCC", "address": [" "], "phone": "(347) 801-7513", "statement": "The stress of trying to manage it all when it feels like you're drowning is exhausting! I specialize in working with women feeling overwhelmed by relationship issues, parenting challenges, a devastating loss, or traumatic event. My clients often struggle with feeling depleted; they're tired, their thoughts keep racing, the anxiety's overwhelming, and they can feel very stuck and all alone with their pain. It's a lot! And when life stressors occur it's ok to not feel ok, it's human. Some who are used to doing things on their own may question why healing would be any different and so continue to suffer. You don't need to go it alone.", "image": "https://photos.psychologytoday.com/7b00d7cb-262e-4a28-ab7f-a24eeb219917/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/elyan-rosenbaum-womens-anxiety-and-trauma-therapist-providing-emdr-and-ifs-brooklyn-ny/863802"},
{"name": "Racquel Jones", "title": "Licensed Master Social Worker, LMSW", "address": [" "], "phone": "(929) 203-8799", "statement": "Pursuing therapy can be a daunting step and finding a therapist you can connect with and trust is a big part of treatment success. I am experienced in a wide range of life's stressors and difficulties. We will work together to instill self understanding and to learn to adopt new attitudes and feelings towards life situation through effective evidence based, psychotherapy methods. I would love to hear your story and support you. As a therapist my goal is to help you understand what both in the here and now and in the past experiences contribute to your life's stressors and work with you to find immediate and long lasting solutions.", "image": "https://photos.psychologytoday.com/dd4f269a-8659-4487-83a2-bfb23efe0ea7/1/320x400.png", "profile_url": "https://www.psychologytoday.com/us/therapists/racquel-jones-brooklyn-ny/1024664"},
{"name": "Charlene Baudet", "title": "Counselor, LMHC", "address": [" "], "phone": "(347) 970-5677", "statement": "Hi! I'm Charlene, and I'll keep this nice and short for you since I also know what it's like to be scrolling through psychtoday on the hunt for a new therapist but overwhelmed by your options. In not so many words, I'm a French-Moroccan licensed mental health counselor specialized in LGBTQ+ health and wellness. I am trained and experienced in the Harm Reduction Psychotherapy to also help clients with any substance use/misuse/and/or abuse reach their goals. Using a person-centered approach I am here to help you reach your goals and thrive in your day to day life.", "image": "https://photos.psychologytoday.com/625188cd-6305-4738-85ee-e67dc33a30e0/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/charlene-baudet-brooklyn-ny/954307"},
{"name": "Amrita Richards", "title": "MHC-LP", "address": [" "], "phone": "(929) 930-6056", "statement": "Are you questioning your decisions, feeling like a failure, struggling with self-esteem and not feeling like you are enough? I'm here to support you on this journey. I use EMDR and IFS techniques to dive into those doubts and insecurities, uncovering the root of your struggles. The work lies in untangling the intricacies of culture and finding that awesome, authentic you hidden beneath it all.  Let's sit down and have a heart-to-heart, no judgment here.", "image": "https://photos.psychologytoday.com/ec103945-7390-431d-9edf-081233238faf/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/amrita-richards-brooklyn-ny/1275201"},
{"name": "Nehemiah Israel Ben - Zev", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(718) 677-0036", "statement": "My approach to tackling life's difficult moments is via the interface of classical  Judaeo-spiritual teachings and the psychological approach of Cognitive Behavioral Therapy. (CBT). The cognitive behavioral approach to psychotherapy teaches that ideation determines the way one feels and acts. Changing the way one thinks triggers a change in the way one feels. I also use \"a strengths perspective\" focusing on the client's stengths which serve to compensate for one's weaknesses. The interface of these three approaches is transformative, and life changing serving to help a client return to his or her innate and authentic self.", "image": "https://photos.psychologytoday.com/3d985c0c-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/nehemiah-israel-ben-zev-brooklyn-ny/203084"},
{"name": "Bryana Greer", "title": "Pre-Licensed Professional, MSEd, MHC-LP", "address": [" "], "phone": "(929) 930-5208", "statement": "I will create a safe space for you to be your authentic self while feeling heard and understood. I support people who are facing life stressors such as anxiety, depression, and trauma. I have experience working with individuals within many diverse populations such as the LGBTQ+ community, those living with disabilities, BIPOC, and young adults. Please reach out to schedule a free phone consult to see if we'd be a good fit. I look forward to meeting you!", "image": "https://photos.psychologytoday.com/7990eb73-eecc-4926-9472-6d115c43a8d8/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/bryana-greer-brooklyn-ny/1023270"},
{"name": "Ian Hollender", "title": "Psychologist, PhD", "address": [" "], "phone": "(646) 941-8499", "statement": "I make use of an integrated approach to psychotherapy that is individualized based on client need, incorporating cognitive behavioral, and dynamic approaches as appropriate, to address difficulties with mood, behavior, motivation, and relationships.  I offer both short and longer term support, as you see fit, to help you grapple with the obstacles you are facing.", "image": "https://photos.psychologytoday.com/0d434a24-7087-40bf-bfe9-43509cead386/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/ian-hollender-brooklyn-ny/204683"},
{"name": "Allison Meade", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(718) 208-9342", "statement": "Whether you're feeling depressed, anxious, hopeless, or lost, making that first call for help can often be hard.  You desperately want to feel better, but you may be afraid of what it will be like to share your thoughts with a therapist.  I understand.  My guiding principles are respect, appreciation of differences, and a balance between acceptance and change.  I listen carefully and center the therapy around your needs.  Through a truly mutual collaboration, we can find ways to solve problems and create healing.", "image": "https://photos.psychologytoday.com/42a1e8a1-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/allison-meade-brooklyn-ny/90563"},
{"name": "Mickey Field - Jamron Counseling", "title": "Pre-Licensed Professional, MA", "address": [" "], "phone": "(929) 339-1569", "statement": "One of the few certainties of life is change, which can come with excitement but also uncertainty and hardship. Whether you are experiencing the stressors of adolescence or young adulthood, confronting relationship issues, or wanting to examine your inner world, therapy can be a useful tool in navigating life transitions. I’m particularly interested in exploring issues surrounding anxiety, depression, relationships, self-worth, grief, gender identity, and sexuality. Together we can discover your wants and needs and take action towards reaching your goals.", "image": "https://photos.psychologytoday.com/98e555af-0a02-47e4-b14e-633be036a3ef/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/mickey-field-jamron-counseling-brooklyn-ny/1265564"},
{"name": "Atiba Okera McLean", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(929) 348-2398", "statement": "My ideal client is the individual who can acknowledge that they need help and is willing to challenge themselves. I am not a magician; I am just a therapist who is willing to go as far as you can.  I am presently growing my practice and I have a group of clinicians who work with me. They are just as qualified and are committed to providing you with the services you need. If we are unable to assist you, we will not hesitate to make a necessary referral. Either way, we strive to be judgment-free.", "image": "https://photos.psychologytoday.com/9105b128-0155-4380-8d8a-412cec6469ef/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/atiba-okera-mclean-brooklyn-ny/856037"}
][
{"name": "Sandra Ivelisse Silvestre", "title": "Pre-Licensed Professional, PhD", "address": [" "], "phone": "(718) 790-4493", "statement": "If you are feeling overwhelmed, anxious, depressed, or are just having mixed feelings and feel like the whole world is coming over you? Contact me, let's talk.  We will work at your pace and know that I will meet you where you are at emotionally.  I have been assessing community needs for over ten years and have learned that there are variables that do contribute to someone's emotional health.  You don't have to feel alone in your process.", "image": "https://photos.psychologytoday.com/535d0904-46cd-11ea-a6ad-06142c356176/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/sandra-ivelisse-silvestre-brooklyn-ny/714184"},
{"name": "Suzette Cook", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(347) 580-5980", "statement": "Are you living the way you were intended to? Or are there seen and unseen barriers blocking your full engagement in life?  Vulnerability to pain and struggle is inherent when we live authentically. It’s our entryway into full human citizenship. And in the acceptance of this struggle lies the birthplace of compassion, connection, authenticity, and joy.  In the space we share together, I want to join you in the quiet conversation you have at your core. A step at a time, we can leave behind the stories you inherited, and perhaps became complicit in, and claim more freedom for your truest self.", "image": "https://photos.psychologytoday.com/5db4d431-dab2-40b7-bea7-6b97f10d9b22/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/suzette-cook-brooklyn-ny/954872"},
{"name": "Daniel R. Trager ( Licensed Mental Health Counselor)", "title": "Counselor, LMHC", "address": [" "], "phone": "(212) 534-7099", "statement": "Accepting new patients in 2024. Confidential video or phone sessions available for your convenience. Over 25 years experience helping adults of all ages navigate life's challenges. My style is interactive, collaborative, supportive and nonjudgmental. You will feel comfortable to discuss your most personal thoughts and feelings.", "image": "https://photos.psychologytoday.com/c60254ca-2b87-4330-84b8-eab4033c68f7/1/320x400.png", "profile_url": "https://www.psychologytoday.com/us/therapists/daniel-r-trager-licensed-mental-health-counselor-brooklyn-ny/244868"},
{"name": "Shella Eliacin", "title": "Clinical Social Work/Therapist, LCSW-R", "address": [" "], "phone": "(718) 618-9024", "statement": "Many people struggle to navigate life’s challenges. It is important that you feel supported while confronting these obstacles. In cultivating a supportive and therapeutic relationship, it is my goal to help you reach your goals.  I have 10+ years’ experience psychotherapist working with teens and adults.  I specialize in treating depression, anxiety, grief, trauma, conflict resolution, work stress and more. As a therapist, my approach is collaborative, trauma informed and integrative; incorporating evidence-based approaches including (CBT) Cognitive Behavioral, (DBT) Dialectical Behavioral Therapy and Emotion Focused Therapy.", "image": "https://photos.psychologytoday.com/43da36f8-cd88-491e-b0a6-fb1be2aff722/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/shella-eliacin-brooklyn-ny/357314"},
{"name": "Cassandra Rampino", "title": "Clinical Social Work/Therapist, LMSW", "address": [" "], "phone": "(332) 334-8218", "statement": "I am passionate about helping my clients become their best selves and believe that the therapeutic relationship is the foundation of true healing. Relationally trained, I like to focus our work on three main pillars: the relationship with yourself, others, and the world. We will explore your past and present experiences to increase awareness and understanding of how we got here and what we need to get you where you want to go. I have extensive experience working with children, adolescents, and adults with varying degrees of care needs.", "image": "https://photos.psychologytoday.com/ac7f2210-d726-4405-91c0-5cd4c429cafa/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/cassandra-rampino-brooklyn-ny/1248408"},
{"name": "Adam Twente", "title": "MS, MHC, LP", "address": [" "], "phone": "(718) 957-2236", "statement": "For everyone there are patterns in our relationships with ourselves and with others that often go unnoticed and unexplored.  Through a psychodynamic and trauma-informed approach, I work with clients to identify these patterns and to develop insight so they can experience more emotional growth and well-being. Change can be hard and we often use avoidance as an ineffective coping mechanism.", "image": "https://photos.psychologytoday.com/3ced2acf-9be3-4a5d-9869-4bbc76fccfbf/2/320x400.png", "profile_url": "https://www.psychologytoday.com/us/therapists/adam-twente-brooklyn-ny/937511"},
{"name": "Evan Illouz", "title": "Psychologist, PsyD", "address": [" "], "phone": "(929) 203-9370", "statement": "Dr. Evan Illouz is a New York State licensed clinical psychologist who specializes in work with children, adolescents, and young adults. Dr. Illouz’s extensive psychotherapy experience spans a variety of settings, including psychiatric hospitals, community mental health clinics, and a private group practice. ", "image": "https://photos.psychologytoday.com/de68a941-26df-447f-b8b2-211f6c0f8806/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/evan-illouz-brooklyn-ny/418761"},
{"name": "Cassandra Mathelier", "title": "Licensed Master Social Worker, LMSW", "address": [" "], "phone": "(929) 955-1260", "statement": "Whether it’s starting a new job, ending a relationship, or feeling stuck in a recurring pattern of behavior, life's many surprises and challenges can feel overwhelming. Therapy can help. I work with individuals to practice reflection and access their internal wisdom. Through this process, you get to know yourself more deeply and embrace the joy within your journey.", "image": "https://photos.psychologytoday.com/63b7f258-a0ef-4218-980c-29a17a3cc46d/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/cassandra-mathelier-brooklyn-ny/1266449"},
{"name": "Ashley Sanders", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": null, "statement": "As a clinical social worker, the bulk of my experience outside of private practice is within the school system. I have been able to work directly with students, teachers, and families on a wide range of issues that are worked on through therapy. I have experience in areas such as: relationship issues (family, romantic, professional etc.), parenting issues, developmental disabilities, depression, anxiety, autism, grief, stress, trauma, and more. In private practice, I appreciate working directly with families, children, individuals, and educators on their presenting needs outside of the constraints of the academic setting.", "image": "https://photos.psychologytoday.com/0251ce9b-7171-4a9e-a7a2-37f1cf6179ac/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/ashley-sanders-brooklyn-ny/1164557"},
{"name": "Julia Jacobson", "title": "Clinical Social Work/Therapist, LCSW, MSEd, RPT-S", "address": [" "], "phone": null, "statement": "I have over 15 years of experience working with children and families. I have treated children with a variety of issues, including: attention and hyperactivity disorders, autism spectrum disorders, developmental delays, anxiety, oppositional defiant disorders, and other behavioral difficulties. I work with children who have experienced trauma, have attachment difficulties, family disruptions, or adjustment issues. I have experience running social skills groups and am trained in Child-Parent Relationship Therapy. I am a member of the Association for Play Therapy and am a Registered Play Therapist Supervisor.", "image": "https://photos.psychologytoday.com/40b78e34-46cd-11ea-a6ad-06142c356176/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/julia-jacobson-brooklyn-ny/308410"},
{"name": "Helen Niu", "title": "Counselor, MA, LMHC", "address": [" "], "phone": "(347) 848-1445", "statement": "As a first-generation Asian American woman, my goal is to explore intersectional issues connecting race, cultural identity, and their impact on mental health and wellness. My approach to therapy is highly compassionate and empathetic, as I provide a space dedicated to making each client feel heard and safe regardless of circumstance. I understand that every individual is unique and thus tailor interventions and techniques to echo your own story.", "image": "https://photos.psychologytoday.com/085bc6d9-c350-470f-ba86-cdc616ac70e3/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/helen-niu-brooklyn-ny/1075356"},
{"name": "Stefania Mogavero", "title": "Counselor, MA, LMHC", "address": [" "], "phone": "(347) 342-1329", "statement": "As a therapist guided by compassion and insight, my mission is to provide a safe and collaborative space where clients can explore the depths of their inner world with curiosity. I believe the alliance between therapist and client to be invaluable in setting the foundation for therapy. I am dedicated to walking alongside my clients as they navigate challenges of life, heal from past wounds, and make progress towards their best selves. I have experience supporting LGBTQIA+ and BIPOC individuals, as well as interethnic and interracial couples through a variety of concerns, such as anxiety, identity, and relationship issues.", "image": "https://photos.psychologytoday.com/7a77153e-7b6b-4f96-b42f-81b545d8e617/4/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/stefania-mogavero-brooklyn-ny/786025"},
{"name": "Alison Cooper", "title": "Counselor, LMHC", "address": [" "], "phone": "(929) 416-2125", "statement": "If you are struggling in your relationships, experiencing a life transition, tired of enduring uncomfortable and painful emotions, finding yourself in patterns that are not serving you, curious to work through trauma, and/or in need of support to cope with all that life can throw at you, I am here for you. My clients tend to be more resilient than they realize, and I am here to help you utilize that strength. Together, we can process whatever it is you are dealing with presently, or have dealt with in the past, and develop tools to help you live the life you want to live, which you deserve.", "image": "https://photos.psychologytoday.com/5b6e1ecc-469d-4e25-9dcc-5d4022d084a2/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/alison-cooper-brooklyn-ny/918882"},
{"name": "Alida Tabaro", "title": "Licensed Mental Health Counselor, LMHC", "address": [" "], "phone": "(929) 377-1328", "statement": "Alida is a mental health counselor committed to creating an atmosphere of safety and understanding. Her work includes identifying various strengths and weaknesses her clients carry. By using different approaches: CBT, DBT, Motivational Interviewing and Person-Centered Therapy, she helps her clients reach their goals. Through her work as a therapist, Alida has found that building sustainable support systems outside of therapy plays a large role in clients’ success. In the past, Alida worked with the homeless and SPMI population and stands as an ally for minority groups including refugee, BIPOC and LGBTQ+.", "image": "https://photos.psychologytoday.com/400bd253-5346-4c4e-a927-09cebc7faf37/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/alida-tabaro-brooklyn-ny/999913"},
{"name": "Lisa Rosenblatt", "title": "Clinical Social Work/Therapist, LCSW, CCTP", "address": [" "], "phone": "(516) 784-5838", "statement": "I am a Licensed Clinical Social Worker specializing in individual, couples and family therapy.  I am a graduate of Wurzweiler School of Social Work and received post graduate training in EMDR, Trauma Focused-Cognitive Behavioral Therapy (TF-CBT), Internal Family Systems, CBT, and Skills Training in Affect and Interpersonal Regulation.  My areas of expertise are addictions (alcohol, drugs, sex, and codependency), sexual abuse, anxiety, depression, parenting and marital issues.  I utilize a variety of methodologies and techniques to best help client achieve their goals.  Much of my work involves healing the inner child which enables the individual/couple to re parent themselves and become empowered.", "image": "https://photos.psychologytoday.com/5ff3564a-9130-4e3b-a547-14026f4efe6e/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/lisa-rosenblatt-brooklyn-ny/375261"},
{"name": "Leslie Feigenbaum", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(347) 836-5614", "statement": "Relationships aren’t easy. We all bring pain and patterns from our past into current relationships, making them feel loaded, tense, and stuck at times. It can be overwhelming trying to navigate strong emotions, betrayals, challenging life events, or just everyday disagreements. But with awareness and understanding we can let go of the constraints of the past and make changes in our interpersonal lives.", "image": "https://photos.psychologytoday.com/c2d91023-b177-4c8b-ab29-6db091395b8a/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/leslie-feigenbaum-brooklyn-ny/847013"},
{"name": "Francesca Aborn", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(646) 916-3769", "statement": "Making the decision to commence therapy can be both tough and uncomfortable, and, can lead to meaningful growth and change. Therapy can provide a very fulfilling and clarifying experience that can assist you in areas of your life where you may feel stuck, trapped and/or just wanting change. Working through these areas can unlock more joy,peace,ease,self-compassion and love.", "image": "https://photos.psychologytoday.com/3af4b7fb-2ae8-4966-a8ae-00040f0885ce/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/francesca-aborn-brooklyn-ny/834321"},
{"name": "Judy Lau", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(347) 396-0991", "statement": "I passionately enjoy working with diverse people “from all walks of life”— professionals, essential workers, parents, students, immigrants, artists, LGBTQA+ community members, caregivers, and allies to people experiencing medical or mental health issues. In therapy, we can appreciate your emotions, problem solve and cope with daily issues, change “undesirable” behaviors, cultivate physical and mental wellness, pursue life/work goals and satisfaction, and practice effective communication skills for interpersonal relationships.", "image": "https://photos.psychologytoday.com/52f64c82-acb3-48ed-b1b0-42fb44f8c0ca/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/judy-lau-brooklyn-ny/1039340"},
{"name": "Kelly J. Wise", "title": "Clinical Social Work/Therapist, PhD, LCSW-R, CST", "address": [" "], "phone": null, "statement": "I have extensive experience doing therapy with individuals, couples and families. My practical and positive approach has helped hundreds of people just like you! I have over 15 years of experience and love helping people in a comfortable, professional and private office environment that will put you at ease.  I have a compassionate, caring, and nonjudgmental style that begins with carefully listening to the issues and deciding together with you on your goals for therapy. I am skilled in many different therapy techniques and frameworks that we can use to help you reach your goals.", "image": "https://photos.psychologytoday.com/71dfdab2-4255-464f-bba4-5e8d0ea8b866/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/kelly-j-wise-brooklyn-ny/96127"},
{"name": "Kate Lawlor", "title": "Psychologist, PsyD", "address": [" "], "phone": "(929) 239-4370", "statement": "My training background combines clinical psychology with children, adolescents, and adults, with highly specialized training and research in neuropsychology. I specialize in neuropsychological assessment, which includes diagnosing neurological and psychiatric disorders, including ADHD, learning disabilities, Autism Spectrum Disorder, anxiety and depression. My assessments provide a detailed look at brain functioning, assessing different skills, such as memory, attention, executive functioning, language, academics, and emotions, and how they interplay to create unique learning profiles for each individual.", "image": "https://photos.psychologytoday.com/3f454ac8-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/kate-lawlor-brooklyn-ny/264329"}
][
{"name": "Patricia Mendell", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(646) 480-7101", "statement": "Deciding to seek out help is often not an easy decision.  As a relationship and marital therapist and a seasoned infertility counselor who also experienced both infertility and pregnancy loss, I am very aware of the impact decision-making choices have on people''s daily lives and relationships.  My approach is interactive and solution focused, and rooted in the belief system that with knowledge, the right support systems, and practical  tools one can overcome any  challenges in their relationship/marital conflicts, anxiety, depression, and recurring negative thoughts in their daily lives and their infertility and pregnancy loss.", "image": "https://photos.psychologytoday.com/44f96082-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/patricia-mendell-brooklyn-ny/85272"},
{"name": "Amy Whelan", "title": "Counselor, LMHC", "address": [" "], "phone": "(646) 450-9521", "statement": "Has your life taken a sharp, unexpected turn at a terrible time? Or maybe you just feel yourself drifting off the path you're traveling and are having difficulty getting back on track. Your vision may be cloudy and that can intensify the amount of distress you feel in your pursuit to returning to your previous level of functioning. What can be even scarier is not knowing when exactly you lost control of the steering wheel or who to rely on in your time of need.", "image": "https://photos.psychologytoday.com/3f852418-46cd-11ea-a6ad-06142c356176/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/amy-whelan-brooklyn-ny/235076"},
{"name": "Stefanie L Stewart", "title": "Pre-Licensed Professional, MHC-LP", "address": [" "], "phone": "(929) 209-7941", "statement": "You are more than this moment, this feeling, this setback, and these thoughts that you just can't get out of your head. Depression and anxiety and oppression and trauma are all real and are all powerful forces that can do so much harm and make you doubt the value you add to the world and the love and respect you deserve. Those voices are not your voice, and I want to help you defeat them.", "image": "https://photos.psychologytoday.com/a539cc65-c7ab-49f4-a8f1-02cec7766110/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/stefanie-l-stewart-brooklyn-ny/1237459"},
{"name": "Tara Anderson", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(917) 338-0232", "statement": "People usually come to therapy seeking relief from problems that have become intrusive, limiting or painful. Through talking in session, you will start to become aware of thoughts and feelings you didn't know you had, of desires hovering below consciousness. My job is to help you connect to your inner experience, and to provide an atmosphere of tolerance and curiosity where we explore it together. The process itself generates insight and emotional awareness. From there we work to transform what you're learning about yourself into positive change and self-assertion.", "image": "https://photos.psychologytoday.com/3e147b1f-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/tara-anderson-brooklyn-ny/221506"},
{"name": "Leila Zhanybekova", "title": "Art Therapist, LCAT, ATR-BC, MPS", "address": [" "], "phone": "(718) 865-3943", "statement": "I specialize in working with acculturation, racial and cultural trauma, gender identity and sexuality, depression, anxiety, and life transition. Together, we collaborate to explore your current struggles, look into your relationships, process your experiences, unpack intergenerational and racial trauma, identify patterns of thought and behavior, and develop insight into your life's path. In session, we build a warm, humorous, and authentic relationship to help you embody your values, grow more connected to yourself and others, build compassion for your emotions, and find a way forward from where you are right now.", "image": "https://photos.psychologytoday.com/0cde974b-5c0d-4ff9-98e9-9439d8b9d8ea/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/leila-zhanybekova-brooklyn-ny/805771"},
{"name": "Rory Gunderson", "title": "Clinical Social Work/Therapist, LMSW", "address": [" "], "phone": "(917) 909-4137", "statement": "By making time for therapy you are already taking a huge step towards improving your life, congratulations! Beginning therapy can be a daunting enterprise, both emotionally and logistically, but it can also be profoundly rewarding. By providing a safe, supportive, warm and empathic space to explore whatever is on your mind, I believe I am able to help you be more comfortable and fulfilled all while gaining valuable insights along the way. I see people from diverse backgrounds and life experiences; addressing issue like grief counseling, combating anxiety and depression, to developing better communication in romantic partners.", "image": "https://photos.psychologytoday.com/d0ba46e2-ade2-4207-8521-080a19ebf6e1/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/rory-gunderson-brooklyn-ny/733300"},
{"name": "Nannan Liu", "title": "Counselor, PhD", "address": [" "], "phone": "(718) 550-4067", "statement": "Dr. Nan Liu, Ph.D., Ed.D. is an experienced clinician and clinical director with over 13 years of supervision experience in counseling and psychiatry. In private practice, Dr. Liu partners with clients to develop treatment plans that are individualized, person-centered, and recovery-oriented. Dr. Liu is deeply invested in helping clients attain their recovery goals, and live happy, meaningful lives. Dr. Liu holds graduate degrees in Counseling Psychology from Columbia University and Johns Hopkins University; and completed clinical training at Columbia University Medical Center.", "image": "https://photos.psychologytoday.com/4675ac2d-c17b-4a01-9b94-65536ecdac62/2/320x400.png", "profile_url": "https://www.psychologytoday.com/us/therapists/nannan-liu-brooklyn-ny/985528"},
{"name": "Emma Larson", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(646) 652-6827", "statement": "Something’s not working. You can see that there’s a problem, but you can’t quite see how to fix it. You know you don’t want things to stay the same, but it’s hard to imagine how they could be different. Whether you’re seeking to build coping skills for increased emotional balance, improve communication in your personal relationships, or untangle deep-seated habits that are holding you back — I can help. Let’s work together to shift your perspective, and find a way forward.", "image": "https://photos.psychologytoday.com/277aa8f2-fedf-485f-9ffe-527e6ac92092/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/emma-larson-brooklyn-ny/1171271"},
{"name": "Rachel Valencia", "title": "Counselor, LMHC", "address": [" "], "phone": "(929) 294-8449", "statement": "Accepting new clients via telehealth! Struggling with your mental health can be difficult, but you don't have to do it alone. Whether it be depression, anxiety, anger, trauma, or other mental health issues, I am here to help you understand where your issues have stemmed from, work on healing them, and learn new ways to cope and interact with your world. In working with me, you can expect to have a safe, non-judgmental space to explore your innerworld. I work with clients of all ages, and in individual, couple, or family modality.", "image": "https://photos.psychologytoday.com/a357c76b-7e55-4ae2-a5e8-51f6aa830de0/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/rachel-valencia-brooklyn-ny/1209853"},
{"name": "Bruce S Hoffman", "title": "Psychologist", "address": [" "], "phone": "(718) 305-1418", "statement": "In my practice, I take pride in treating everyone as an individual and consider differences in their histories, personalities and the different ways they cope with their emotional distress.  I consider these differences and similarities extremely carefully whenever I design a patients treatment plan.  \nBENEFITS\nThere are five goals that are almost always achieved when under my care.\n1)Increased insight or improved understanding of one's own mental state.  This can range from simply knowing one's strengths and weaknesses, to understanding their symptoms are signs of mental illness, and to deepen their awareness and acceptance of inner feelings.", "image": "https://photos.psychologytoday.com/5e1d21ea-ecb2-4cc3-a2bf-eec59e394e57/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/bruce-s-hoffman-brooklyn-ny/69145"},
{"name": "Ari Amir", "title": "Licensed Psychoanalyst, LP, MA", "address": [" "], "phone": "(347) 960-0594", "statement": "This is a charged moment. Seeking a place to work on yourself, someone who can help you do so... it can feel wild and uncomfortable. I hope you will feel that you can trust me enough to welcome you into this work. To get to know you and work alongside you to find the things that seem to repeat themselves in your life. To understand why - but just as importantly, how - they happen. To create a space in which you will feel seen, heard, and understood. In the way I work, I will address the current situations you bring to therapy and also try and understand them in the context of the life you've lived until now.", "image": "https://photos.psychologytoday.com/1fb66202-34b1-466e-b33b-5c67dc26acd1/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/ari-amir-brooklyn-ny/1192412"},
{"name": "Adena Bella Ruchames", "title": "Clinical Social Work/Therapist", "address": [" "], "phone": "(347) 801-7622", "statement": "Has infertility, pregnancy, and/or new motherhood been impacting your life recently? These are some of the most stressful experiences we can have in life. It's common to feel overwhelmed, lonely, and lost during these times which is why therapy can be so important. As someone who is trained and certified in perinatal mood disorders, I am passionate about helping mothers no matter what stage of their journey they are on.          I believe you as a client know what you need. I am here to listen, validate, support, and guide you through this phase of your life.", "image": "https://photos.psychologytoday.com/dbd296b6-5169-4a57-9ff5-59293de2729d/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/adena-bella-ruchames-brooklyn-ny/1102180"},
{"name": "Teresa Solomita", "title": "Clinical Social Work/Therapist, LCSW-R, NCPsyA", "address": [" "], "phone": "(646) 798-6162", "statement": "You're on your way in your career, you're single, you want a relationship and you're frustrated with the difficulties of finding a partner.  You find yourself spending more time at work than braving the NYC dating scene or dating apps while wondering what you might be contributing to the problem.  Part of you is preoccupied with a previous relationship and another part of you is just sick of the dating life.   Beleaguered by online dating burnout, you tell yourself your career is enough! Yet a part of you can't delete all the apps on your phone, can't help wondering.  You feel overwhelmed with anxiety when you think about all this.", "image": "https://photos.psychologytoday.com/cf821ba0-2e8c-4e5e-b458-f0ced270e2c8/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/teresa-solomita-brooklyn-ny/52029"},
{"name": "Esteban Rios", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(929) 810-2216", "statement": "Esteban J. Rios, LCSW, is a practicing therapist with over 28 years in the human services field. He has a passion for helping people reach their highest potential in life. Esteban has a desire to help people understand their past experiences and help make changes in their lives. Using a holistic approach to his work, he is attentive to his clients' needs and goals. Esteban uses evidenced-based practices to inform treatment, including Cognitive Behavioral Therapy and Motivational Interviewing.", "image": "https://photos.psychologytoday.com/4330b815-9a41-4213-bd18-24f32d6cd0a6/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/esteban-rios-brooklyn-ny/1146787"},
{"name": "Eric Strauss", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(917) 810-2164", "statement": "My practice is varied, although the focus over the years has been the LGBTQ community.  I also see singles, couples and families not identified as LGBTQ.  My role is to be a supportive agent, assisting the client to explore their past and present and to be more open about conflicts that are causing stress. Together, we explore the clients family history, in order to develop a deeper understanding of their present patterns and relationships. Anxiety, low self-esteem, sexuality, work problems are all examined. As a parent who has adopted, I work with families and individuals around adoption/foster care issues.", "image": "https://photos.psychologytoday.com/0ee1f1b1-5ef9-492e-9766-a0b2aa338309/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/eric-strauss-brooklyn-ny/105828"},
{"name": "Cecilia Diana Francis", "title": "Clinical Social Work/Therapist, PhD, LCSW-R", "address": [" "], "phone": "(718) 285-7166", "statement": "As we journey through life's stages, we encounter peaks, valleys and adverse circumstances that will throw us off course. Choosing the high road can be difficult especially when we are stressed, anxious, facing relational problems, parenting problems and difficulties on the workplace. I will teach you coping skills to deal with these unforeseen situations and even with those that are most anticipated. I subscribe to a proactive approach to therapy; focusing on the individual's strengths, without neglecting practical and real issues of human frailties.", "image": "https://photos.psychologytoday.com/3d7a4d69-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/cecilia-diana-francis-brooklyn-ny/198136"},
{"name": "Nanna Waldroup", "title": "Pre-Licensed Professional, MHC-LP", "address": [" "], "phone": "(929) 207-8128", "statement": "You used to have big dreams for yourself, but nothing turned out the way you hoped. You sometimes feel like giving up because you just can’t do it. You doubt yourself and your abilities. You wish you were better. You wish you had accomplished more, but you are worried that it’s too late. You want to feel capable, confident, and ready to take on the world. You want to feel successful and proud. You want to feel like you are moving forward in your life. You’ve come to the right place.", "image": "https://photos.psychologytoday.com/cdebe190-320d-43ee-8c88-c84fd3933aa2/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/nanna-waldroup-brooklyn-ny/892445"},
{"name": "Joanna Hunt (Micek)", "title": "Counselor, LMHC", "address": [" "], "phone": "(516) 260-4068", "statement": "The decision to enter into therapy is a meaningful step towards self-discovery. It is important to find a therapist that allows you to grow and understand yourself on a deeper level in a way that feels safe. It is through this healing relationship, positive changes are truly possible. ", "image": "https://photos.psychologytoday.com/4386a07c-46cd-11ea-a6ad-06142c356176/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/joanna-hunt-micek-brooklyn-ny/309199"},
{"name": "Princess Rallins", "title": "Counselor, MS, LMHC", "address": [" "], "phone": "(518) 975-2817", "statement": "I believe therapy is a collaborative effort, based on treating each client as an individual with specific needs and empowering clients through education and self-discovery. My approach is non-judgemental, culturally competent, strength based and I empower you to discover your own solutions by utilizing evidenced based approaches. My specializations include working with clients who suffer from issues related to self-esteem/self-worth, relationship conflict, racial adversities, microaggressions within the workplace, maternal issues and adjustment disorders.", "image": "https://photos.psychologytoday.com/c7f326c4-36b3-4153-b082-f90b44f8153d/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/princess-rallins-brooklyn-ny/902649"},
{"name": "Christine Mindicino", "title": "Clinical Social Work/Therapist, LCSW-R", "address": [" "], "phone": "(929) 383-6938", "statement": "I offer a relaxed therapeutic environment where you can process feelings at your own pace while gaining tools to navigate challenges. My specialty areas include anxiety disorders, trauma, depression, interpersonal/relationship issues and life transitions. The therapeutic style I utilize combines trauma focused approaches, cognitive behavioral therapy, dialectical behavior therapy and person centered interventions based on the specific needs of each client.", "image": "https://photos.psychologytoday.com/bcaefd92-af77-4754-9d2c-883337504144/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/christine-mindicino-brooklyn-ny/1058715"},
{"name": "Augusta Gordon", "title": "Clinical Social Work/Therapist, LCSW-R, SIFI, RYT 200", "address": [" "], "phone": "(347) 960-4354", "statement": "Augusta is an empathic practitioner who is passionate about helping clients to grow as individuals, while improving their emotional and physical well-being. As with most healers, she came to psychotherapy by way of seeking change, and has a first hand understanding of what it feels like to need guidance and support. When working with clients, she relies on an integration of methods tailored to meet the needs of the client she is working with. She prefers a holistic framework focusing on the interconnectedness of our minds and body using a combination of psychodynamic, CBT, DBT and mindfulness-related yoga/Buddhist interventions.", "image": "https://photos.psychologytoday.com/457e33ff-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/augusta-gordon-brooklyn-ny/266441"},
{"name": "Orly Bendavid - illumind Psychotherapy", "title": "Creative Arts Therapist, MA, MT-BC, LCAT", "address": [" "], "phone": "(747) 271-5270", "statement": "We offer creative therapy for creative people because sometimes words are not enough. We primarily use verbal psychotherapy practices to treat our clients, and depending on your needs we may take a more active role and offer, music, visual art, poetry, movement, drama, or EMDR to help you move those sticky feelings. Our goal is to help you create a sense of flow in your life. Therapy like our art, can help us gain insight, reduce anxiety, worry, fear and help us increase our consciousness and connection to our innermost self. No experience in the arts is necessary.", "image": "https://photos.psychologytoday.com/dc5c953f-0769-43dc-b754-1a98b4513841/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/orly-bendavid-illumind-psychotherapy-brooklyn-ny/246117"},
{"name": "Zoe Hicks", "title": "Marriage & Family Therapist, MA, LMFT", "address": [" "], "phone": "(347) 970-5594", "statement": "Today you are one step closer to a new you where you feel empowered and on a positive path to growth and well-being.  As a psychotherapist, my goal is to help you uncover your true potential and lead a life that is worth celebrating. While we can't change difficult situations of the past, we can work together to better understand and resolve challenges in your life.  By applying complementary therapy approaches and techniques, we will unearth long-standing behavior patterns or negative perceptions that may be holding you back from experiencing a more fulfilling and meaningful life.", "image": "https://photos.psychologytoday.com/3c797aa3-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/zoe-hicks-brooklyn-ny/114024"},
{"name": "Alison Capaldi", "title": "MSEd, MPhilEd, MHC-LP", "address": [" "], "phone": "(914) 454-2697", "statement": "I am passionate about working with adolescents, adults, and their families/support systems. I have particular specialties using research-based practices to work with individuals struggling with Anxiety Disorders and Obsessive-Compulsive Disorder. In addition to those specialties, I support clients through a wide range of challenges including, depression, stress management, life transitions, and career and academic stress.", "image": "https://photos.psychologytoday.com/060b7679-8e44-4c51-ba3e-149eb2f91bae/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/alison-capaldi-brooklyn-ny/1199134"},
{"name": "Suzette Cook", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(347) 580-5980", "statement": "Are you living the way you were intended to? Or are there seen and unseen barriers blocking your full engagement in life?  Vulnerability to pain and struggle is inherent when we live authentically. It’s our entryway into full human citizenship. And in the acceptance of this struggle lies the birthplace of compassion, connection, authenticity, and joy.  In the space we share together, I want to join you in the quiet conversation you have at your core. A step at a time, we can leave behind the stories you inherited, and perhaps became complicit in, and claim more freedom for your truest self.", "image": "https://photos.psychologytoday.com/5db4d431-dab2-40b7-bea7-6b97f10d9b22/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/suzette-cook-brooklyn-ny/954872"},
{"name": "Briana Weiner", "title": "Counselor, MBA, LMHC", "address": [" "], "phone": "(646) 956-2329", "statement": "Searching for a therapist can feel discouraging at times and raise endless questions. What exactly am I looking for? Will I feel understood? Would I even benefit from therapy? I believe that once you find the right fit, the transformative nature of the therapy relationship can help you find your voice and a true sense of direction.  I approach therapy from a place of humor, curiosity and an honest desire to help you uncover those places where you feel most stuck in order to build the life that you want.", "image": "https://photos.psychologytoday.com/640c4a8c-540e-4aa9-8b5e-59d658fecfa0/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/briana-weiner-brooklyn-ny/441967"},
{"name": "Carolay Ceballos - Jamron Counseling", "title": "MHC-LP", "address": [" "], "phone": "(929) 368-5399", "statement": "Whether addressing past wounds and traumas with gentle care or seeking assistance in navigating the intricacies and pressures of daily life, I am fully dedicated to joining you on this meaningful journey of uncovering your true self. Self-exploration requires courage and commitment, and I am here to collaborate and help you do that. Working together, we'll explore your inner world, thoughts, and feelings with curiosity to uncover underlying beliefs, patterns, and behaviors to help you achieve your goals.", "image": "https://photos.psychologytoday.com/a079ae0b-1686-4708-9c5c-872ba59da299/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/carolay-ceballos-jamron-counseling-brooklyn-ny/1178176"},
{"name": "Saul D. Raw, LCSW", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(718) 682-7508", "statement": "With over 40 years of clinical experience, my practice is located in the Park Slope section of Brooklyn and is convenient to public transportation. Faculty Weill Medical College of Cornell University Department of Psychiatry 1979-2014.Former Professional Associate (Psychiatry), The New York Presbyterian Hospital.   My approach is integrative and I do both long and short-term work.  I believe that psychotherapy must be adapted to the person and not the other way around.  I have extensive experience in the treatment of anxiety and depression, relationship and sexual problems, and fears, phobias, and obsessions.", "image": "https://photos.psychologytoday.com/3b6c0dce-46cd-11ea-a6ad-06142c356176/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/saul-d-raw-lcsw-brooklyn-ny/33532"},
{"name": "Zan Jacobus Insight Psychotherapy", "title": "Clinical Social Work/Therapist, MA, LCSW", "address": [" "], "phone": "(718) 569-7881", "statement": "It is a privilege to be a therapist because patients entrust you with closely held and often pained parts of themselves, along with parts of themselves they are excited about and proud of. I see our work as the creation of a place where these different parts of the patient's self can come into the room and be acknowledged and recognized.  Therapy is also a place where you, as the patient, can use my listening ear to help you withstand pain and anxiety.  Please see my website: zanjacobusinsightpsychotherapy.com", "image": "https://photos.psychologytoday.com/3b726f88-46cd-11ea-a6ad-06142c356176/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/zan-jacobus-insight-psychotherapy-brooklyn-ny/34392"},
{"name": "Hilary Roy", "title": "Counselor, MA, LMHC", "address": [" "], "phone": "(646) 681-5836", "statement": "Real inner change begins with a conversation with a compassionate, caring other. In connection there is growth. As a relational therapist I listen attentively without agenda or judgment, with the goal of helping you understand yourself and your life story better. Whether your roadblocks are connected to your internal world of thoughts and feelings or external system of relationships, career and family, I am committed to understanding you in terms of your own experience. For over 15 years, I have helped children, adolescents, adults and families experience life with a greater sense of personal agency, ease, clarity and choice.", "image": "https://photos.psychologytoday.com/1654ca8e-13c1-46e4-9b33-7b7523421c27/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/hilary-roy-brooklyn-ny/1047305"},
{"name": "Kadosh Mental Health Services", "title": "Counselor, MA, LMHC, PsyD", "address": [" "], "phone": "(929) 242-4861", "statement": "Welcome! With care, dedication and a unique approach I specialize in the treatment of addictive behaviors, anxiety, personality disorders, grief and relationship challenges. Fully licensed psychotherapist in New York State.  I trained in Chile and in New York City. ​ I completed a license in Psychology in the Universidad Diego Portales, Chile. I continued my studies in an Applied Psychology Degree at New York University and I was awarded as providing outstanding clinical service by New York University. Please visit my personal webpage for more information http://www.kadoshpsychotherapy.org/", "image": "https://photos.psychologytoday.com/536b29d7-46cd-11ea-a6ad-06142c356176/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/kadosh-mental-health-services-brooklyn-ny/366422"},
{"name": "Jasmine P Loubriel", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(347) 408-2991", "statement": "I am a Bilingual Licensed Clinical Social Worker with 15+ years of experience working with a culturally diverse urban population of adults in NYC dealing with various issues such as grief, trauma, depression, anxiety, anger, conflict resolution, stress management, self-esteem and adjustment issues.", "image": "https://photos.psychologytoday.com/80c00957-ce33-4482-8e6a-1afba6e20d4d/9/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/jasmine-p-loubriel-brooklyn-ny/1078814"},
{"name": "Jennifer L. McDonough", "title": "Clinical Social Work/Therapist, LCSW-R", "address": [" "], "phone": "(929) 410-5260", "statement": "Are you feeling isolated from family or friends; unable to get out doors as easily as before due to chronic medical conditions, worried about the day to day problems, like transportation to a doctor, how to access services, or about how to better communicate with family, friends, or your doctor?  Are you struggling with deeper emotional troubles such as learning to cope with the loss of a loved one who may have moved or passed away, or having to cope with chronic pain, or symptoms of depression or anxiety?", "image": "https://photos.psychologytoday.com/92907ddf-3661-40f3-8c74-afbfe2d59da7/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/jennifer-l-mcdonough-brooklyn-ny/749597"},
{"name": "Giacomo S Buscaino", "title": "Psychologist, PsyD", "address": [" "], "phone": "(646) 759-0107", "statement": "I am a licensed psychologist based in Bay Ridge who works with adolescents and adults of all ages and backgrounds. We all experience pain in our lives which is very individual and personal. I treat those who experience a wide variety of pain, which may include struggles with anxiety, depression, anger, life transitions, bereavement, relationship conflicts, trauma, and professional obstacles. In addition to aiming to provide a supportive and collaborative therapy experience, my philosophy is that there are many roads to healing - therefore, I take on an integrative stance in my work, and use a variety of treatment approaches.", "image": "https://photos.psychologytoday.com/3f6f353e-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/giacomo-s-buscaino-brooklyn-ny/225110"},
{"name": "Rashida Gordon", "title": "Clinical Social Work/Therapist, LCSW, Casac-t", "address": [" "], "phone": "(646) 791-4034", "statement": "I like to begin by creating a safe space for you to be vulnerable as you embark on this journey to address things in your life, relationships and from your past that have you feeling “stuck”.  My specialty is working with the individual (s) to explore behavioral patterns that lead to problem areas to increase insight, motivation and a sense of agency to take on change. I do not see individuals as problem but rather as people with problems. Problems are temporary. Let’s begin this journey.....to discovering to best version of yourself. ", "image": "https://photos.psychologytoday.com/bb9ae9c1-e472-4907-8bce-243a20195c80/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/rashida-gordon-brooklyn-ny/775232"},
{"name": "Michaela D'Urso", "title": "Pre-Licensed Professional, MS", "address": [" "], "phone": null, "statement": "Michaela is a passionate Cognitive Behavioral therapist (which is the most effective, researched, and validated therapy to date). She will work with you to identify and change overly negative thinking and unhelpful behaviors that interfere with your mood, reaching your goals, or hampering interpersonal relationships. She works with those struggling with depression, anxiety, worry, phobias, stress, body image issues, performance anxiety, defiant behavior in children, relationship struggles, and work/school issues.", "image": "https://photos.psychologytoday.com/bb42e955-5ae8-4bfd-93de-6389708dd9a1/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/michaela-durso-brooklyn-ny/1110498"},
{"name": "Christine Tergis", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(646) 992-8482", "statement": "Therapy is a powerful tool to aid in healing emotional pain and facilitating improved well-being. If you struggle with stress and overwhelm, low self-esteem, trouble in relationships, or depressed mood or anxiety related to specific incidents or in general – healing is possible and I can help. My approach is warm, collaborative, and individualized, focusing not merely on treating symptoms, but on supporting you as a whole person deserving of a safe space in which to feel heard and understood.", "image": "https://photos.psychologytoday.com/dde957a1-a7e7-4a74-83d7-d63ea22d1798/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/christine-tergis-brooklyn-ny/1205155"},
{"name": "Helen Kyla Buchsbaum", "title": "Psychologist, PhD", "address": [" "], "phone": "(929) 332-2618", "statement": "I have 35 + years experience working with children, adolescents and adults. I believe therapy is most effective when you experience your therapist as a safe, accepting person. Initial sessions focus on identifying what prompted you to seek therapy and how you hope therapy will help. Together we explore obstacles and ways to become less ‘stuck’. I use psychodynamic, developmental and relational approaches to understand and address the challenges you face. I also draw on techniques from many approaches to select practical tools tailored to most effectively help you.", "image": null, "profile_url": "https://www.psychologytoday.com/us/therapists/helen-kyla-buchsbaum-brooklyn-ny/725488"},
{"name": "Hope Services, LLC", "title": "PhD, LMHC", "address": [" "], "phone": "(917) 310-5891", "statement": "Our individual therapies include play, creative arts and talk therapy for children and adolescents struggling with functioning in their families, school, community, and social/interpersonal relationships. Cognitive Behavioral / Behavior Modification interventions are also provided. Hope Services, LLC is located in the Mill Basin section of Brooklyn, New York. We are a dynamic, innovative, pragmatic and professional outpatient mental health service program with a patient-centered treatment model that is geared toward providing services to the multicultural community within which it operates. With a specialty in providing treatment to children and adolescents (ages 5-18), Hope Services, LLC also accepts and treats adults. We are therefore dedicated to the mental and behavioral healthcare of children, adolescents, adults, families and couples. We offer a safe, therapeutic, comfortable, and respectful environment. Additional Languages Spoken: French, Haitian Creole.", "image": null, "profile_url": "https://www.psychologytoday.com/us/therapists/hope-services-llc-brooklyn-ny/208145"},
{"name": "Goldi Srebro", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(718) 215-9969", "statement": "Imagine how you'd like to be in a year from now. Take a moment; I'll wait... Would you like to feel more alive, more energized, and at peace with yourself and those around you? Would you like to let go of the heavy boulders of anxiety, panic, anger, depression, and trauma symptoms? My goal is to join you on your journey to healing and help you achieve your vision. Why don't we chat for a few minutes, so you can see if this is the right choice for you? I look forward to getting to know you!", "image": "https://photos.psychologytoday.com/d5ddab97-65d7-4760-8848-da294c1ddeea/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/goldi-srebro-brooklyn-ny/876028"},
{"name": "Patricia Mendell", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(646) 480-7101", "statement": "Deciding to seek out help is often not an easy decision.  As a relationship and marital therapist and a seasoned infertility counselor who also experienced both infertility and pregnancy loss, I am very aware of the impact decision-making choices have on people''s daily lives and relationships.  My approach is interactive and solution focused, and rooted in the belief system that with knowledge, the right support systems, and practical  tools one can overcome any  challenges in their relationship/marital conflicts, anxiety, depression, and recurring negative thoughts in their daily lives and their infertility and pregnancy loss.", "image": "https://photos.psychologytoday.com/44f96082-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/patricia-mendell-brooklyn-ny/85272"},
{"name": "Amy Whelan", "title": "Counselor, LMHC", "address": [" "], "phone": "(646) 450-9521", "statement": "Has your life taken a sharp, unexpected turn at a terrible time? Or maybe you just feel yourself drifting off the path you're traveling and are having difficulty getting back on track. Your vision may be cloudy and that can intensify the amount of distress you feel in your pursuit to returning to your previous level of functioning. What can be even scarier is not knowing when exactly you lost control of the steering wheel or who to rely on in your time of need.", "image": "https://photos.psychologytoday.com/3f852418-46cd-11ea-a6ad-06142c356176/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/amy-whelan-brooklyn-ny/235076"},
{"name": "Stefanie L Stewart", "title": "Pre-Licensed Professional, MHC-LP", "address": [" "], "phone": "(929) 209-7941", "statement": "You are more than this moment, this feeling, this setback, and these thoughts that you just can't get out of your head. Depression and anxiety and oppression and trauma are all real and are all powerful forces that can do so much harm and make you doubt the value you add to the world and the love and respect you deserve. Those voices are not your voice, and I want to help you defeat them.", "image": "https://photos.psychologytoday.com/a539cc65-c7ab-49f4-a8f1-02cec7766110/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/stefanie-l-stewart-brooklyn-ny/1237459"},
{"name": "Tara Anderson", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(917) 338-0232", "statement": "People usually come to therapy seeking relief from problems that have become intrusive, limiting or painful. Through talking in session, you will start to become aware of thoughts and feelings you didn't know you had, of desires hovering below consciousness. My job is to help you connect to your inner experience, and to provide an atmosphere of tolerance and curiosity where we explore it together. The process itself generates insight and emotional awareness. From there we work to transform what you're learning about yourself into positive change and self-assertion.", "image": "https://photos.psychologytoday.com/3e147b1f-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/tara-anderson-brooklyn-ny/221506"},
{"name": "Leila Zhanybekova", "title": "Art Therapist, LCAT, ATR-BC, MPS", "address": [" "], "phone": "(718) 865-3943", "statement": "I specialize in working with acculturation, racial and cultural trauma, gender identity and sexuality, depression, anxiety, and life transition. Together, we collaborate to explore your current struggles, look into your relationships, process your experiences, unpack intergenerational and racial trauma, identify patterns of thought and behavior, and develop insight into your life's path. In session, we build a warm, humorous, and authentic relationship to help you embody your values, grow more connected to yourself and others, build compassion for your emotions, and find a way forward from where you are right now.", "image": "https://photos.psychologytoday.com/0cde974b-5c0d-4ff9-98e9-9439d8b9d8ea/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/leila-zhanybekova-brooklyn-ny/805771"},
{"name": "Rory Gunderson", "title": "Clinical Social Work/Therapist, LMSW", "address": [" "], "phone": "(917) 909-4137", "statement": "By making time for therapy you are already taking a huge step towards improving your life, congratulations! Beginning therapy can be a daunting enterprise, both emotionally and logistically, but it can also be profoundly rewarding. By providing a safe, supportive, warm and empathic space to explore whatever is on your mind, I believe I am able to help you be more comfortable and fulfilled all while gaining valuable insights along the way. I see people from diverse backgrounds and life experiences; addressing issue like grief counseling, combating anxiety and depression, to developing better communication in romantic partners.", "image": "https://photos.psychologytoday.com/d0ba46e2-ade2-4207-8521-080a19ebf6e1/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/rory-gunderson-brooklyn-ny/733300"},
{"name": "Nannan Liu", "title": "Counselor, PhD", "address": [" "], "phone": "(718) 550-4067", "statement": "Dr. Nan Liu, Ph.D., Ed.D. is an experienced clinician and clinical director with over 13 years of supervision experience in counseling and psychiatry. In private practice, Dr. Liu partners with clients to develop treatment plans that are individualized, person-centered, and recovery-oriented. Dr. Liu is deeply invested in helping clients attain their recovery goals, and live happy, meaningful lives. Dr. Liu holds graduate degrees in Counseling Psychology from Columbia University and Johns Hopkins University; and completed clinical training at Columbia University Medical Center.", "image": "https://photos.psychologytoday.com/4675ac2d-c17b-4a01-9b94-65536ecdac62/2/320x400.png", "profile_url": "https://www.psychologytoday.com/us/therapists/nannan-liu-brooklyn-ny/985528"},
{"name": "Emma Larson", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(646) 652-6827", "statement": "Something’s not working. You can see that there’s a problem, but you can’t quite see how to fix it. You know you don’t want things to stay the same, but it’s hard to imagine how they could be different. Whether you’re seeking to build coping skills for increased emotional balance, improve communication in your personal relationships, or untangle deep-seated habits that are holding you back — I can help. Let’s work together to shift your perspective, and find a way forward.", "image": "https://photos.psychologytoday.com/277aa8f2-fedf-485f-9ffe-527e6ac92092/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/emma-larson-brooklyn-ny/1171271"},
{"name": "Rachel Valencia", "title": "Counselor, LMHC", "address": [" "], "phone": "(929) 294-8449", "statement": "Accepting new clients via telehealth! Struggling with your mental health can be difficult, but you don't have to do it alone. Whether it be depression, anxiety, anger, trauma, or other mental health issues, I am here to help you understand where your issues have stemmed from, work on healing them, and learn new ways to cope and interact with your world. In working with me, you can expect to have a safe, non-judgmental space to explore your innerworld. I work with clients of all ages, and in individual, couple, or family modality.", "image": "https://photos.psychologytoday.com/a357c76b-7e55-4ae2-a5e8-51f6aa830de0/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/rachel-valencia-brooklyn-ny/1209853"},
{"name": "Bruce S Hoffman", "title": "Psychologist", "address": [" "], "phone": "(718) 305-1418", "statement": "In my practice, I take pride in treating everyone as an individual and consider differences in their histories, personalities and the different ways they cope with their emotional distress.  I consider these differences and similarities extremely carefully whenever I design a patients treatment plan.  \nBENEFITS\nThere are five goals that are almost always achieved when under my care.\n1)Increased insight or improved understanding of one's own mental state.  This can range from simply knowing one's strengths and weaknesses, to understanding their symptoms are signs of mental illness, and to deepen their awareness and acceptance of inner feelings.", "image": "https://photos.psychologytoday.com/5e1d21ea-ecb2-4cc3-a2bf-eec59e394e57/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/bruce-s-hoffman-brooklyn-ny/69145"},
{"name": "Ari Amir", "title": "Licensed Psychoanalyst, LP, MA", "address": [" "], "phone": "(347) 960-0594", "statement": "This is a charged moment. Seeking a place to work on yourself, someone who can help you do so... it can feel wild and uncomfortable. I hope you will feel that you can trust me enough to welcome you into this work. To get to know you and work alongside you to find the things that seem to repeat themselves in your life. To understand why - but just as importantly, how - they happen. To create a space in which you will feel seen, heard, and understood. In the way I work, I will address the current situations you bring to therapy and also try and understand them in the context of the life you've lived until now.", "image": "https://photos.psychologytoday.com/1fb66202-34b1-466e-b33b-5c67dc26acd1/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/ari-amir-brooklyn-ny/1192412"},
{"name": "Adena Bella Ruchames", "title": "Clinical Social Work/Therapist", "address": [" "], "phone": "(347) 801-7622", "statement": "Has infertility, pregnancy, and/or new motherhood been impacting your life recently? These are some of the most stressful experiences we can have in life. It's common to feel overwhelmed, lonely, and lost during these times which is why therapy can be so important. As someone who is trained and certified in perinatal mood disorders, I am passionate about helping mothers no matter what stage of their journey they are on.          I believe you as a client know what you need. I am here to listen, validate, support, and guide you through this phase of your life.", "image": "https://photos.psychologytoday.com/dbd296b6-5169-4a57-9ff5-59293de2729d/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/adena-bella-ruchames-brooklyn-ny/1102180"},
{"name": "Teresa Solomita", "title": "Clinical Social Work/Therapist, LCSW-R, NCPsyA", "address": [" "], "phone": "(646) 798-6162", "statement": "You're on your way in your career, you're single, you want a relationship and you're frustrated with the difficulties of finding a partner.  You find yourself spending more time at work than braving the NYC dating scene or dating apps while wondering what you might be contributing to the problem.  Part of you is preoccupied with a previous relationship and another part of you is just sick of the dating life.   Beleaguered by online dating burnout, you tell yourself your career is enough! Yet a part of you can't delete all the apps on your phone, can't help wondering.  You feel overwhelmed with anxiety when you think about all this.", "image": "https://photos.psychologytoday.com/cf821ba0-2e8c-4e5e-b458-f0ced270e2c8/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/teresa-solomita-brooklyn-ny/52029"},
{"name": "Esteban Rios", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(929) 810-2216", "statement": "Esteban J. Rios, LCSW, is a practicing therapist with over 28 years in the human services field. He has a passion for helping people reach their highest potential in life. Esteban has a desire to help people understand their past experiences and help make changes in their lives. Using a holistic approach to his work, he is attentive to his clients' needs and goals. Esteban uses evidenced-based practices to inform treatment, including Cognitive Behavioral Therapy and Motivational Interviewing.", "image": "https://photos.psychologytoday.com/4330b815-9a41-4213-bd18-24f32d6cd0a6/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/esteban-rios-brooklyn-ny/1146787"},
{"name": "Eric Strauss", "title": "Clinical Social Work/Therapist, LCSW", "address": [" "], "phone": "(917) 810-2164", "statement": "My practice is varied, although the focus over the years has been the LGBTQ community.  I also see singles, couples and families not identified as LGBTQ.  My role is to be a supportive agent, assisting the client to explore their past and present and to be more open about conflicts that are causing stress. Together, we explore the clients family history, in order to develop a deeper understanding of their present patterns and relationships. Anxiety, low self-esteem, sexuality, work problems are all examined. As a parent who has adopted, I work with families and individuals around adoption/foster care issues.", "image": "https://photos.psychologytoday.com/0ee1f1b1-5ef9-492e-9766-a0b2aa338309/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/eric-strauss-brooklyn-ny/105828"},
{"name": "Cecilia Diana Francis", "title": "Clinical Social Work/Therapist, PhD, LCSW-R", "address": [" "], "phone": "(718) 285-7166", "statement": "As we journey through life's stages, we encounter peaks, valleys and adverse circumstances that will throw us off course. Choosing the high road can be difficult especially when we are stressed, anxious, facing relational problems, parenting problems and difficulties on the workplace. I will teach you coping skills to deal with these unforeseen situations and even with those that are most anticipated. I subscribe to a proactive approach to therapy; focusing on the individual's strengths, without neglecting practical and real issues of human frailties.", "image": "https://photos.psychologytoday.com/3d7a4d69-46cd-11ea-a6ad-06142c356176/2/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/cecilia-diana-francis-brooklyn-ny/198136"},
{"name": "Nanna Waldroup", "title": "Pre-Licensed Professional, MHC-LP", "address": [" "], "phone": "(929) 207-8128", "statement": "You used to have big dreams for yourself, but nothing turned out the way you hoped. You sometimes feel like giving up because you just can’t do it. You doubt yourself and your abilities. You wish you were better. You wish you had accomplished more, but you are worried that it’s too late. You want to feel capable, confident, and ready to take on the world. You want to feel successful and proud. You want to feel like you are moving forward in your life. You’ve come to the right place.", "image": "https://photos.psychologytoday.com/cdebe190-320d-43ee-8c88-c84fd3933aa2/3/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/nanna-waldroup-brooklyn-ny/892445"},
{"name": "Joanna Hunt (Micek)", "title": "Counselor, LMHC", "address": [" "], "phone": "(516) 260-4068", "statement": "The decision to enter into therapy is a meaningful step towards self-discovery. It is important to find a therapist that allows you to grow and understand yourself on a deeper level in a way that feels safe. It is through this healing relationship, positive changes are truly possible. ", "image": "https://photos.psychologytoday.com/4386a07c-46cd-11ea-a6ad-06142c356176/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/joanna-hunt-micek-brooklyn-ny/309199"},
{"name": "Princess Rallins", "title": "Counselor, MS, LMHC", "address": [" "], "phone": "(518) 975-2817", "statement": "I believe therapy is a collaborative effort, based on treating each client as an individual with specific needs and empowering clients through education and self-discovery. My approach is non-judgemental, culturally competent, strength based and I empower you to discover your own solutions by utilizing evidenced based approaches. My specializations include working with clients who suffer from issues related to self-esteem/self-worth, relationship conflict, racial adversities, microaggressions within the workplace, maternal issues and adjustment disorders.", "image": "https://photos.psychologytoday.com/c7f326c4-36b3-4153-b082-f90b44f8153d/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/princess-rallins-brooklyn-ny/902649"},
{"name": "Christine Mindicino", "title": "Clinical Social Work/Therapist, LCSW-R", "address": [" "], "phone": "(929) 383-6938", "statement": "I offer a relaxed therapeutic environment where you can process feelings at your own pace while gaining tools to navigate challenges. My specialty areas include anxiety disorders, trauma, depression, interpersonal/relationship issues and life transitions. The therapeutic style I utilize combines trauma focused approaches, cognitive behavioral therapy, dialectical behavior therapy and person centered interventions based on the specific needs of each client.", "image": "https://photos.psychologytoday.com/bcaefd92-af77-4754-9d2c-883337504144/1/320x400.jpeg", "profile_url": "https://www.psychologytoday.com/us/therapists/christine-mindicino-brooklyn-ny/1058715"}
]